/*
========================================================================================================================================
========================================================================================================================================

Redis : سریع و مبتنی بر حافظه است که به دلیل سرعت بالا مقیاس‌ پذیری و (Key-Value) یک پایگاه داده‌ی کلید - مقدار 
و پردازش داده‌های (message queues) صف‌های پیام (sessions)، مدیریت جلسات (caching) انعطاف ‌پذیری معمولاً برای کشینگ
هستش RAM بلادرنگ استفاده می‌شود و محل ذخیره سازی اون حافظه
    
========================================================================================================================================

دستورات اصلی مربوط به داده‌ها

nil  :  هستش null دیتای وجود نداشته رو بهمون میگوید که معادل همون 

1. SET و GET

SET برای ذخیره‌سازی یک کلید و مقدار استفاده می‌شود

SET key value [expiration EX seconds | PX milliseconds] [NX | XX]

EX seconds: تنظیم زمان انقضا به ثانیه

PX milliseconds: تنظیم زمان انقضا به میلی‌ثانیه

NX: ذخیره فقط اگر کلید وجود نداشته باشد

XX: ذخیره فقط اگر کلید وجود داشته باشد

در دو حالت دیتاهای ما در داخل ردیس میان و منقضی می شوند

1 - حالتی هستش که ما بیایم و دیتاهامون رو به صورت دستی  خودمون حذف کنیم

2-  قرار بدهیم  expiration Time برای مواقعی هستش که خودمون بیایم و برای کدهامون 


EXAMPLE ================================================================================================================================

SET name "Emad" EX 20

GET name

========================================================================================================================================

2. حذف کلید

DEL key   حذف یک کلید از پایگاه داده

========================================================================================================================================
    
3. چک کردن وجود کلید

EXISTS key  بررسی می‌کند که آیا کلید مورد نظر وجود دارد یا خیر

ما در داخل ردیس میتونیم بیایم و یک کلید رو چند بار تعریف کنیم و استفاده کنیم انگار یک کلید تکراری رو تعریف کنیم ولی با مقادیر مختلف

NX : Not exist  مخفف  

برای حل این مشکل از کامند بالا در داخل دستورات دیگر استفاده میکنیم

SETNX  username amir 

GET username

========================================================================================================================================

4. چندین مقدار

MSET و MGET  ذخیره و دریافت چندین مقدار با استفاده از 

MSET key1 value1 key2 value2

MGET key1 key2

========================================================================================================================================

5. عملیات روی رشته‌ها

APPEND: اضافه کردن مقدار به انتهای یک کلید موجود

APPEND key value

========================================================================================================================================

STRLEN: طول رشته

STRLEN key

========================================================================================================================================

GETRANGE: دریافت بخشی از رشته

GETRANGE key start end

SET message "hello world"

GETRANGE message 0 4  // "hello"

SET message "hello ali . welcome to my website"

GETRANGE message 0 4   // "hello"

GETSET message "new message"  // میکنه و انجام می دهد SET  میکنه و بعد برامون اون مقدار رو  GET اول میاد و برامون 


========================================================================================================================================

GETSET: تنظیم مقدار جدید و برگرداندن مقدار قبلی

GETSET key value

========================================================================================================================================

6. برای تغیر دادن نام یک کلید همبه روش زیر عمل میکنیم

RENAME  key  newkey

RENAMENX  key  newkey  برای این که چک کنه همچین مقداری از قبل وجود نداشته باشد 

========================================================================================================================================
========================================================================================================================================

*/