/*
========================================================================================================================================
========================================================================================================================================

عملیات روی رشته‌ها

APPEND: اضافه کردن مقدار به انتهای یک کلید موجود

APPEND key value

STRLEN: طول رشته

STRLEN key

GETRANGE: دریافت بخشی از رشته

GETRANGE key start end

SET message "hello world"

GETRANGE message 0 4  // "hello"

GETSET: تنظیم مقدار جدید و برگرداندن مقدار قبلی

GETSET key value

در داخل یک رشته باید بیایم و اون رو به صورت رشته بنویسیم فقط بین هر  دابل کوتیشن قبل اون از \ باید استفاده بکنیمJSON نکته : برای ذخیره  

"{ \"name\" : \"moein\"  ,  \"password\": 1234  }"

========================================================================================================================================

اعداد و شمارنده‌ها

INCR و DECR : افزایش یا کاهش مقدار عددی یک کلید

INCR key

DECR key

SET like_count  1

GET like_count 

INCR  like_count   //  فقط ماهیت امون باید عددی باشه

DECR  like_count   //  فقط ماهیت امون باید عددی باشه

========================================================================================================================================

مدیریت انقضا و زمان‌بندی

تنظیم زمان انقضا

EXPIRE key seconds

چک کردن زمان باقی‌مانده

TTL key  مقدار -1 نشان‌دهنده‌ی عدم وجود زمان انقضا است

========================================================================================================================================

 



========================================================================================================================================
========================================================================================================================================
*/
