/*
=========================================================================================================================================
=========================================================================================================================================

سرعت کار کردن با ردیس به تعداد درخواست ها و پاسخ هامون بستگی داره

Transaction : باشند یعنی همه دستورات Atomic تضمین می‌کند که این دستورات اتمی Redis مجموعه‌ای از دستورات هستند که به ترتیب اجرا می‌شوند

با موفقیت اجرا می‌شوند یا هیچ‌کدام اجرا نمی‌شوند

=========================================================================================================================================

Redis  ویژگی‌های تراکنش‌ها در 

اتمی بودن  همه دستورات در یک تراکنش به‌صورت کامل اجرا می‌شوند

بدون قطعیت در اجرا  اگر خطایی در یک دستور رخ دهد، دستورات دیگر همچنان اجرا می‌شوند

به قبل از اجرای تراکنش را ندارد  Rollback قابلیت بازگرداندن وضعیت Rollback: Redis بدون

دستورات تراکنش را به‌صورت بهینه و سریع اجرا می‌کند Redis سرعت بالا

=========================================================================================================================================

Redis  مراحل اجرای تراکنش در

برای شروع یک تراکنش استفاده می‌شود MULTI  شروع تراکنش : دستور  

افزودن دستورات: دستورات موردنظر در صف تراکنش قرار می‌گیرند

برای اجرای دستورات صف شده استفاده می‌شود EXEC اجرای تراکنش: دستور  

استفاده می‌شود DISCARD  لغو تراکنش: اگر بخواهید دستورات صف شده را لغو کنید، از دستور 

=========================================================================================================================================

دستورات اصلی تراکنش

1. MULTI  این دستور تراکنش را شروع می‌کند و دستورات بعدی را در صف اجرا قرار می‌دهد

2. EXEC برای اجرای دستورات صف شده استفاده می‌شود

3. DISCARD برای لغو دستورات صف شده استفاده می‌شود

4. WATCH  این دستور برای مانیتور کردن یک یا چند کلید استفاده می‌شود. اگر کلیدی که مانیتور شده تغییر کند، تراکنش لغو می‌شود

WATCH key1 key2

5. UNWATCH  برای لغو مانیتورینگ کلیدها استفاده می‌شود

Example  =================================================================================================================================

مثال ساده از تراکنش

فرض کنید می‌خواهید موجودی یک حساب بانکی را کم کنید و موجودی حساب دیگر را افزایش دهید

شروع تراکنش

MULTI

افزودن دستورات 

DECRBY account:1001 50
INCRBY account:1002 50

اجرای تراکنش

EXEC

=========================================================================================================================================
=========================================================================================================================================
*/