/*==========================================================================================================================================================================
============================================================================================================================================================================

SET نوع داده ای 

1 - آن را نادیده می‌گیرد Redis  فقط مقادیر یکتا را ذخیره می‌کند. اگر تلاش کنید مقدار تکراری اضافه کنید SET مقادیر یکتا 

2 -  ها انجام دهید SET را روی difference و تفاضل intersection اشتراک  union عملیات ریاضی : می‌توانید عملیات مجموعه‌ای مثل اتحاد 

3 -  انجام می‌شود  O(1) ها مانند افزودن، حذف و بررسی عضویت، به طور متوسط با پیچیدگی زمانیSET‌ دسترسی سریع: عملیات روی 


SADD myset "value1" "value2" "value3"  استفاده می‌شود SADD  از دستور SET  برای افزودن یک یا چند مقدار به

SMEMBERS myset استفاده می‌شود SMEMBERS  از دستور  SET برای دریافت تمامی اعضای یک 

SISMEMBER myset "value"   استفاده می‌شود  SISMEMBER  وجود دارد یا خیر، از دستور  SET  برای بررسی اینکه آیا مقداری در

SREM myset "value1" "value2"  استفاده می‌شود   SREM  از دستور  SET  برای حذف یک یا چند مقدار از 

SUNION set1 set2  اتحاد ( UNION ) :  استفاده می‌شود  SUNION از دستور  SET برای دریافت اتحاد دو یا چند

SRANDMEMBER myset  count   استفاده می‌شود SRANDMEMBER از دستور  SET   برای انتخاب یک مقدار تصادفی از 

SPOP myset   استفاده می‌شود SPOP از دستور  SET  برای انتخاب و حذف یک مقدار تصادفی از 


SMOVE source destination member به مجموعه دیگر استفاده می‌شود. این دستور یک عملیات اتمی است به این معنی که عضو موردنظر از مجموعه SET برای انتقال یک عضو از یک مجموعه

مبدأ حذف شده و هم‌زمان به مجموعه مقصد اضافه می‌شود

==========================================================================================================================================================================

Hash ویژگی‌های اصلی :

1 - شامل یک کلید اصلی است و درون آن جفت‌های کلید-مقدار ذخیره می‌شوند Hash ساختار جفت کلید-مقدار : هر

2 -  بهینه‌ تر از ذخیره هر فیلد در کلیدهای جداگانه است Hash مدیریت کارآمد حافظه : برای داده‌های کوچک و مرتبط ( مثل اطلاعات کاربر )

3 - دسترسی سریع به فیلدها : امکان خواندن و نوشتن روی فیلدها به‌صورت جداگانه وجود دارد

HSET user:1001 name "Ali" age "25" country "Iran"  : استفاده می‌شود Hash برای افزودن یک یا چند جفت کلید-مقدار به یک 

HGET user:1001 name   استفاده می‌شود Hash  برای دریافت مقدار یک فیلد خاص در 

HMGET HMGET user:1001 name country برای دریافت مقدار چند فیلد به‌صورت هم‌زمان
 
HGETALL  Hash برای دریافت تمام جفت‌های کلید-مقدار در یک 

HDEL user:1001 age Hash  برای حذف یک یا چند فیلد از یک 

HEXISTS user:1001 name Hash برای بررسی وجود یک فیلد خاص در 

HLEN user:1001   Hash برای دریافت تعداد کل فیلدهای موجود در یک

HKEYS user:1001  Hash برای دریافت لیستی از کلیدهای فیلدهای 

HVALS user:1001  Hash برای دریافت لیستی از مقادیر تمام فیلدهای 

HINCRBY user:1001 age 1  برای افزایش مقدار یک فیلد عددی به میزان مشخص

HINCRBYFLOAT user:1001 balance 12.5  برای افزایش مقدار عددی یک فیلد به‌صورت اعشاری

===========================================================================================================================================================================

Redis  ویژگی‌های تراکنش‌ها در 

اتمی بودن  همه دستورات در یک تراکنش به‌صورت کامل اجرا می‌شوند

بدون قطعیت در اجرا  اگر خطایی در یک دستور رخ دهد، دستورات دیگر همچنان اجرا می‌شوند

به قبل از اجرای تراکنش را نداردRollback قابلیت بازگرداندن وضعیت Rollback: Redis بدون

دستورات تراکنش را به‌صورت بهینه و سریع اجرا می‌کند Redis سرعت بالا


Redis  ویژگی‌های تراکنش‌ها در 

اتمی بودن  همه دستورات در یک تراکنش به‌صورت کامل اجرا می‌شوند

بدون قطعیت در اجرا  اگر خطایی در یک دستور رخ دهد، دستورات دیگر همچنان اجرا می‌شوند

به قبل از اجرای تراکنش را نداردRollback قابلیت بازگرداندن وضعیت Rollback: Redis بدون

دستورات تراکنش را به‌صورت بهینه و سریع اجرا می‌کند Redis سرعت بالا


Redis  مراحل اجرای تراکنش در

برای شروع یک تراکنش استفاده می‌شود MULTI  شروع تراکنش : دستور  

افزودن دستورات: دستورات موردنظر در صف تراکنش قرار می‌گیرند

برای اجرای دستورات صف شده استفاده می‌شود EXEC اجرای تراکنش: دستور  

استفاده می‌شود DISCARD لغو تراکنش: اگر بخواهید دستورات صف شده را لغو کنید، از دستور 


دستورات اصلی تراکنش

1. MULTI  این دستور تراکنش را شروع می‌کند و دستورات بعدی را در صف اجرا قرار می‌دهد

2. EXEC برای اجرای دستورات صف شده استفاده می‌شود

3. DISCARD برای لغو دستورات صف شده استفاده می‌شود

4. WATCH  این دستور برای مانیتور کردن یک یا چند کلید استفاده می‌شود. اگر کلیدی که مانیتور شده تغییر کند، تراکنش لغو می‌شود

WATCH key1 key2

5. UNWATCH  برای لغو مانیتورینگ کلیدها استفاده می‌شود

===========================================================================================================================================================================
==========================================================================================================================================================================*/