/*==========================================================================================================================================================================
============================================================================================================================================================================

SET key value [expiration EX seconds | PX milliseconds] [NX | XX]

DEL key

EXISTS username

SETNX key value

MSET key1 value1 key2 value2 

GETSET key value

RENAME oldKey newKey

RENAMENX oldKey newKey

==========================================================================================================================================================================

APPEND key value  اضافه کردن مقدار به انتهای یک کلید موجود

STRLEN key طول رشته

GETRANGE key start end  دریافت بخشی از رشته

GETSET key value تنظیم مقدار جدید و برگرداندن مقدار قبلی

در داخل یک رشته باید بیایم و اون رو به صورت رشته بنویسیم فقط بین هر  دابل کوتیشن قبل اون از \ باید استفاده بکنیم JSON نکته : برای ذخیره  

"{ \"name\" : \"moein\"  ,  \"password\": 1234  }"
 
INCR  like_count   //   فقط ماهیت امون باید عددی باشه ( افزایش مقدار عددی یک کلید )

DECR  like_count   //  فقط ماهیت امون باید عددی باشه ( کاهش مقدار عددی یک کلید )

GETRANGE key start end //  دریافت بخشی از رشته

TTL key : استفاده می‌کنیم TTL  برای بررسی اینکه چه مقدار زمان تا انقضای یک کلید باقی مانده است، از دستور

==========================================================================================================================================================================

LPUSH  courses "nest"  "php"   "nodejs"  "wordpress"    به اول لیست امون اضافه میکند 

RPUSH courses "nest"  "php"   "nodejs"  "wordpress"   به آخر لیست امون میاد و اضافه میکند  

LRANGE  key  start stop حالا برای این که بتونیم مقادیر ایتم های لیست امون استفاده بکنیم از دستور  زیر استفاده میکنیم

LLEN key  این دستور به ما طول لیستی که درست کردیم رو می دهد

RPOP key برای پاک کردن لیست از سمت راست

LPOP key برای پاک کردن لیست از سمت چپ


LREM  key count value   این دستور برای این هستش که یک مقدار خاصی رو بتونیم از یک لیست پاک کنیم

key: نام لیستی که قصد دارید مقادیر را از آن حذف کنید

count : مشخص می‌کند که چند بار باید مقدار موردنظر حذف شود

باشد  حذف از ابتدای لیست به تعداد مشخص‌شده انجام می‌شود  count > 0  اگر

باشد  حذف از انتهای لیست به تعداد مشخص‌شده انجام می‌شود  count < 0  اگر

باشد  تمام موارد مقدار مشخص‌شده در کل لیست حذف می‌شود  count = 0   اگر

value: مقدار موردنظر که می‌خواهید حذف شود


LSET key index value  برای به‌روزرسانی مقدار یک عنصر در موقعیت مشخص در یک لیست استفاده می‌شود  LSET  دستور  

LTRIM key start stop  : برای محدود کردن اندازه لیست به محدوده‌ای مشخص از ایندکس‌ها استفاده می‌شود. این دستور تنها عناصر موجود در محدوده مشخص‌شده را نگه می‌دارد و بقیه را حذف می‌کند


LINSERT برای درج یک مقدار جدید در یک لیست موجود استفاده می‌شود. این دستور به شما اجازه می‌دهد که  مقدار جدید را قبل یا بعد از   

در لیست درج کنید pivot یک مقدار مشخص

LINSERT key BEFORE|AFTER pivot value

key: نام لیست که مقدار جدید باید در آن درج شود.

pivot: مقداری که مقدار جدید نسبت به آن درج خواهد شد

BEFORE | AFTER:  اضافه شود  pivot از مقدار مشخص‌شده AFTER یا بعد BEFORE مشخص می‌کند که مقدار جدید قبل 

value: مقدار جدیدی که باید به لیست اضافه شود

در موقعیت‌های مختلف LINSERT رفتار 
 
اگر کلید وجود نداشته باشد → هیچ عملی انجام نمی‌شود و مقدار 0 برمی‌گردد

اگر عملیات موفقیت‌آمیز باشد → طول جدید لیست را برمی‌گرداند

در لیست وجود نداشته باشد → هیچ تغییری در لیست رخ نمی‌دهد و مقدار -1 برمی‌گردد pivot اگر مقدار 


LINDEX : اگر بخواهید یک مقدار را بر اساس ایندکس آن در لیست بگیرید، می‌توانید از دستور  استفاده کنید

key: نام لیستی که می‌خواهید مقدار را از آن دریافت کنید

index: شماره ایندکس مقدار مورد نظر (ایندکس از ۰ شروع می‌شود)

==========================================================================================================================================================================
==========================================================================================================================================================================*/