/*
========================================================================================================================================
========================================================================================================================================

عملیات روی رشته‌ها

APPEND: اضافه کردن مقدار به انتهای یک کلید موجود

APPEND key value

STRLEN: طول رشته

STRLEN key

GETRANGE: دریافت بخشی از رشته

GETRANGE key start end

SET message "hello world"

GETRANGE message 0 4  // "hello"

GETSET: تنظیم مقدار جدید و برگرداندن مقدار قبلی

GETSET key value

در داخل یک رشته باید بیایم و اون رو به صورت رشته بنویسیم فقط بین هر  دابل کوتیشن قبل اون از \ باید استفاده بکنیم JSON نکته : برای ذخیره  

"{ \"name\" : \"moein\"  ,  \"password\": 1234  }"

========================================================================================================================================

اعداد و شمارنده‌ها

INCR و DECR : افزایش یا کاهش مقدار عددی یک کلید

INCR key

DECR key

SET like_count  1

GET like_count 

INCR  like_count   //  فقط ماهیت امون باید عددی باشه

DECR  like_count   //  فقط ماهیت امون باید عددی باشه

========================================================================================================================================

(TTL) بررسی زمان باقی‌مانده تا انقضا  

TTL key : استفاده می‌کنیم TTL  برای بررسی اینکه چه مقدار زمان تا انقضای یک کلید باقی مانده است، از دستور

اگر مقدار -1 برگردد: یعنی کلید هیچ زمان انقضایی ندارد و به‌صورت دائمی ذخیره شده است

اگر مقدار -2 برگردد: یعنی کلید قبلاً منقضی شده و دیگر وجود ندارد

اگر مقدار عددی مثبت برگردد : یعنی کلید هنوز وجود دارد و این عدد نشان‌دهنده‌ی تعداد ثانیه‌های باقی‌مانده تا انقضا است

========================================================================================================================================
 
5. عملیات روی رشته‌ها

APPEND: اضافه کردن مقدار به انتهای یک کلید موجود

APPEND key value

(integer)   #  خروجی که می دهد  طول جدید رشته هست اش

========================================================================================================================================

STRLEN: طول رشته

STRLEN key

========================================================================================================================================

GETRANGE: دریافت بخشی از رشته

GETRANGE key start end

SET message "hello world"

GETRANGE message 0 4  // "hello"

SET message "hello ali . welcome to my website"

GETRANGE message 0 4   // "hello"

GETSET message "new message"  // میکنه و انجام می دهد SET  میکنه و بعد برامون اون مقدار رو  GET اول میاد و برامون 

س========================================================================================================================================
========================================================================================================================================
*/
